In [9]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
df = DataFrame(np.arange(4).reshape((2, 2)), columns = list('XY'),              #'List' creates a column out of 'XY' (shortcut)
              index = ['BER', 'DUB']) 
df

     X  Y
BER  0  1
DUB  2  3

In [3]:
df2 = DataFrame(np.arange(9).reshape((3, 3)), columns = list('XBC'),index = ['DUB', 'BER', 'WDC']) #Must be same index as above
df2

     X  B  C
DUB  0  1  2
BER  3  4  5
WDC  6  7  8

In [4]:
df + df2

      B   C    X   Y
BER NaN NaN  3.0 NaN
DUB NaN NaN  2.0 NaN
WDC NaN NaN  NaN NaN

In [5]:
df.add(df2, fill_value = 0)

       B    C    X    Y
BER  4.0  5.0  3.0  1.0
DUB  1.0  2.0  2.0  3.0
WDC  7.0  8.0  6.0  NaN

In [6]:
ser = df2.iloc[0]
ser

X    0
B    1
C    2
Name: DUB, dtype: int32

In [7]:
df2-ser

     X  B  C
DUB  0  0  0
BER  3  3  3
WDC  6  6  6

In [8]:
df2

     X  B  C
DUB  0  1  2
BER  3  4  5
WDC  6  7  8